app/views/temporders/index.html.erb

      <tr>
        <td text-align="left"><%=Product.find(showProduct.Product_id).product_name%></td>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 8 LIMIT 1