app/controllers/categories_controller.rb

  def show
    @cat = Product.where(category_id: params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1