app/controllers/home_controller.rb

  def front

    @Products = Product.all
---
SELECT `products`.* FROM `products`