app/controllers/orders_controller.rb

INSERT INTO `orders` (`user_id`, `total`, `Gen_id`, `created_at`, `updated_at`) VALUES (1, 42578, '87eee67c23bb41fe3b2c1c4fd2142cdd', '2018-04-09 14:05:12', '2018-04-09 14:05:12')
SELECT `temporders`.* FROM `temporders` WHERE `temporders`.`Gen_id` = '87eee67c23bb41fe3b2c1c4fd2142cdd'
---
  def create

  @order = Order.new(order_params)
 @order.save!
  @temporders = Temporder.where(:Gen_id =>session[:GenVal])