app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def show
    @showproduct = Product.find params[:id]

SELECT `categories`.* FROM `categories`
---
  def new
    @cateogories = Category.all

INSERT INTO `products` (`product_name`, `description`, `price`, `category_id`, `created_at`, `updated_at`) VALUES ('Laptop', 'Macbook', 1900, 1, '2018-04-05 00:18:24', '2018-04-05 00:18:24')
---
  def create
    prod = Product.new (params.require(:product).permit(:product_name, :description,:price,:category_id))
    prod.save

SELECT `products`.* FROM `products`
---
  def index
    @Products = Product.all