app/controllers/temporders_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `temporders` (`User_id`, `Product_id`, `Price`, `Gen_id`, `created_at`, `updated_at`) VALUES (1, 10, 678, '87eee67c23bb41fe3b2c1c4fd2142cdd', '2018-04-09 13:35:11', '2018-04-09 13:35:11')
---
  def create
    @user = User.find(current_user.id)
    # @order = @user.orders.new(order_params)
    # @order.save!

    @order = Temporder.new(order_params)
    @order.save!

SELECT `temporders`.* FROM `temporders` WHERE `temporders`.`Gen_id` = '87eee67c23bb41fe3b2c1c4fd2142cdd'
---
  def index
    gene_id =  session[:GenVal]
    @items = Temporder.where(Gen_id:gene_id )

SELECT  `temporders`.* FROM `temporders` WHERE `temporders`.`id` = 3 LIMIT 1
DELETE FROM `temporders` WHERE `temporders`.`id` = 3
SELECT `temporders`.* FROM `temporders` WHERE `temporders`.`Gen_id` = 'a550e4d4427f632c7a10e4339145665b'
---
  def show
    gene_id =  session[:GenVal]
    @items = Temporder.find(params[:id])
    @items.delete
    @items = Temporder.where(Gen_id:gene_id )