app/views/products/new.html.erb

      <div class="col-xs-4 col-lg-4" style="text-align: left"><%=form.label :Category %>:</div>
      <div class="col-xs-4 col-lg-4"><%= form.collection_select(:category_id, Category.all, :id, :name ) %>
---
SELECT `categories`.* FROM `categories`